Revit 2026 API

# RevisionNumberingSequenceSequenceName Property

---

The name of this revision numbering sequence.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SequenceName { get; set; }
```
```vb
Public Property SequenceName As String
	Get
	Set
```
```cpp
public:
property String^ SequenceName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SequenceName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: sequenceName is an empty string or contains only whitespace. -or- When setting this property: sequenceName cannot include prohibited characters, such as "{, }, [, ], | , ;, less-than sign, greater-than sign, ?, `, ~". |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This name appears in the Sheet Issues/Revisions dialog as a numbering choice for each revision.

#### Reference

RevisionNumberingSequence Class

Autodesk.Revit.DB Namespace